tap "ethereum/ethereum"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "minio/stable"
tap "playcover/playcover"
tap "redis-stack/redis-stack"
tap "shivammathur/php"
# C parser in Python
brew "pycparser", link: false
# C Foreign Function Interface for Python
brew "cffi", link: false
# Cryptographic recipes and primitives for Python
brew "python-cryptography", link: false
# Automate deployment, configuration, and upgrading
brew "ansible"
# Python code formatter
brew "black"
# Linter for YAML files
brew "yamllint"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# List ASCII idiomatic names and octal/decimal code-point forms
brew "ascii"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# CloudFlare's PKI toolkit
brew "cfssl"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Generate a Clang compilation database for Make-based build systems
brew "compiledb"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php", link: false
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Diff that understands syntax
brew "difftastic"
# Tool for exploring each layer in a docker image
brew "dive"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Official Go implementation of the Ethereum protocol
brew "ethereum"
# Modern replacement for 'ls'
brew "exa"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Assuan IPC Library
brew "libassuan"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Go programming environment (1.17)
brew "go@1.17", link: true
# Ping, but with a graph
brew "gping"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Apache HTTP server
brew "httpd"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Command-line benchmarking tool
brew "hyperfine"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Development kit for the Java programming language
brew "openjdk"
# Pentaho Data Integration software
brew "kettle"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Generic machine emulator and virtualizer
brew "qemu"
# Linux virtual machines
brew "lima"
# Development kit for the Java programming language
brew "openjdk@17"
# Tool for managing events and logs
brew "logstash"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Keep your Mac's application settings in sync
brew "mackup"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Scalable distributed version control system
brew "mercurial"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Package manager for Microsoft development platform including .NET
brew "nuget"
# Cross-platform library for audio I/O
brew "portaudio"
# Modern replacement for ps written by Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Password generator
brew "pwgen"
# Cross-platform application and UI framework
brew "qt@5"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Simple file transfer tools, similar to lrzsz (rz/sz), and compatible with tmux
brew "trzsz"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Terraform
brew "hashicorp/tap/terraform"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# General-purpose scripting language
brew "shivammathur/php/php@7.2"
# General-purpose scripting language
brew "shivammathur/php/php@7.4", link: true
# Intelligent cloud storage platform
cask "adrive"
# Note editor and whiteboard
cask "affine"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Memory training application
cask "anki"
# Chromium based browser
cask "arc"
# Cloud storage service
cask "baidunetdisk"
# Compare files and folders
cask "beyond-compare"
# Official bilibili video streaming and sharing platform
cask "bilibili"
# GUI Client for GRPC Services
cask "bloomrpc"
# Trains AIs to understand and translate texts
cask "deepl"
# UI to create reproducible developer environments based on a devcontainer.json
cask "devpod"
# Teamwork app by Alibaba Group
cask "dingtalk"
# Voice and text chat software
cask "discord"
# Online diagram software
cask "drawio"
# Project management software
cask "feishu"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-consolas-for-powerline"
cask "font-hack"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Nerd Font font with round corners
cask "font-maple"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Development environment
cask "hashicorp-vagrant"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customizer
cask "karabiner-elements"
# File archiver
cask "keka"
# Desktop reader for Kobo eBooks
cask "kobo"
# Utility to open, create and modify archive files
cask "maczip"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Online collaborative whiteboard platform
cask "miro"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Scheduling application focusing on organization
cask "omnifocus"
# Visual communication software
cask "omnigraffle"
# Desktop virtualization software
cask "parallels"
# Sideload iOS apps and games
cask "playcover-nightly"
# Collaboration platform for API development
cask "postman"
# Instant messaging tool
cask "qq"
# Chinese music streaming application
cask "qqmusic"
# Import highlights from Apple Books to Readwise
cask "readwise-ibooks"
# Redis server with additional database capabilities and the visualisation tool RedisInsight.
cask "redis-stack"
# A graphical tool for visualizing data and managing Redis databases
cask "redis-stack-redisinsight"
# Redis Stack Server install a Redis server with additional database capabilities
cask "redis-stack-server"
# Open source virtual/remote desktop application
cask "rustdesk"
# Collection of apps available by subscription
cask "setapp"
# Share peripherals between computers
cask "sharemouse"
# Digital design and prototyping platform
cask "sketch"
# Graphical client for Git version control
cask "sourcetree"
# App to switch hosts
cask "switchhosts"
# Data visualization software
cask "tableau"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Utility to hide the notch
cask "topnotch"
# Configurable document editor that supports Markdown
cask "typora"
# PDF editor
cask "updf"
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Open-source code editor
cask "visual-studio-code"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Free messaging and calling application
cask "wechat"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Mind mapping and brainstorming tool
cask "xmind"
# Mesh VPN client
cask "zerotier-one"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "alexisvt.flutter-snippets"
vscode "anseki.vscode-color"
vscode "bbenoist.vagrant"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "franneck94.c-cpp-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "holmescn.vscode-wordcount-cjk"
vscode "humao.rest-client"
vscode "ionutvmi.path-autocomplete"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "jeff-hykin.better-cpp-syntax"
vscode "lunuan.kubernetes-templates"
vscode "mitaki28.vscode-clang"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "msjsdiag.vscode-react-native"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "salemcode8.vagrant-manager"
vscode "sumneko.lua"
vscode "techer.open-in-browser"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "XadillaX.viml"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yinfei.luahelper"
vscode "zhuangtongfa.material-theme"
vscode "zobo.php-intellisense"
